Revit 2027 API
IFCData.HasSimpleType Method
 Determines if there is one corresponding IFC type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasSimpleType()
Public Function HasSimpleType As Boolean
public:
bool HasSimpleType()
member HasSimpleType : unit -> bool
Return Value
Boolean
 False if there are no corresponding IFC types, or more than one; returns true otherwise.
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace